[
    {
        "id": 1,
        "slug": "rmsg",
        "title": "Risk Management Solutions Group",
        "image": "rmsg-thumb.jpg",
        "year": "2020",
        "tag": "Website",
        "description": "Risk Management Solutions Group is a public marketing website I built in 2 weeks for Bankers Healthcare Group at the end of 2020 using the <a href='https://symfony.com/' target='_blank'>Symfony Framework</a>, <a href='https://twig.symfony.com/' target='_blank'>Twig</a>, <a href='https://sass-lang.com/' target='_blank'>Sass</a> and <a href='https://www.javascript.com/' target='_blank'>JavaScript</a>.",
        "technology": "<a href='https://symfony.com/'>Symfony Framework</a>, <a href='https://twig.symfony.com/' target='_blank'>Twig</a>, <a href='https://sass-lang.com/' target='_blank'>Sass</a>, <a href='https://www.javascript.com/' target='_blank'>JavaScript</a>",
        "url": "https://riskmsg.com",
        "body": "<p>Risk Management Solutions Group was my first experience using the Symfony Framework. Prior to this project, the team I'm a part of at Bankers Healthcare Group exclusively used the Laravel Framework. Luckily the boilerplates between the frameworks are not too different, both use similar routing, controllers, and the <a href='https://twig.symfony.com/' target='_blank'>Twig templating engine</a>. This made the move to Symfony less of a learning curve and allowed me to focus on the front-end of this project more than the organization and setup of the new framework.</p><p>I had approximately 2 weeks to get the website developed, while not having a final design at the time I put pen to paper. I handled this scenario by starting my development at the mid-fidelity level. I didn’t theme the project or add any images until they were provided. The site was various shades of gray and the font’s weren’t even finalized, but the structure and layout was there.</p><p>As the imagery, brand, and content was approved and delivered to me, I was already done with the heavy lifting of the project. I was able to focus on those nit-picky items as they came to me. I was not going to miss the deadline by doing what I could ahead of time.</p><p>The website was one of the first to use a shared NPM package I wrote with mixins, variables and, most specifically, form styles that I used on the contact form. All I had to do was install the package using yarn, import the main.scss file into my project's Sass, and call the form mixin. Just like that all the styles were applied to our SDK’s generated forms.</p><p>Sometimes front-end development can feel like magic! &#128516;</p>"
    },
    {
        "id": 2,
        "slug": "careers",
        "title": "Careers at BHG",
        "image": "careers-thumb.jpg",
        "year": "2020",
        "tag": "Website",
        "description": "Careers at BHG is where Bankers Healthcare Group posts new jobs and team information as well as stories and culture news. I built this site in June of 2020 using the <a href='https://laravel.com/' target='_blank'>Laravel Framework</a>, <a href='https://twig.symfony.com/' target='_blank'>Twig</a>, <a href='https://sass-lang.com/' target='_blank'>Sass</a> and <a href='https://www.javascript.com/' target='_blank'>JavaScript</a>.",
        "technology": "<a href='https://laravel.com/' target='_blank'>Laravel Framework</a>, <a href='https://twig.symfony.com/' target='_blank'>Twig</a>, <a href='https://sass-lang.com/' target='_blank'>Sass</a>, <a href='https://www.javascript.com/' target='_blank'>JavaScript</a>",
        "url": "https://careersatbhg.com",
        "body": "<p>Careers at BHG was a really fun project for me to work on, because I knew going into the project the importance of it; this website would be the first impression of many new employees at the company.</p><p>There were a lot of moving pieces to this project. The different buckets/areas of the site were managed by different business areas, so I was working with both the Marketing team and the HR team at the company, and getting feedback from all of them. This website was also the first one where I was solely responsible for the front-end and the deliverable dates.</p><p>This site was not templated and each page posed its own unique styles and challenges at every breakpoint. The colorful grids that you see are actually built with flexbox, and they restructure and restack at every breakpoint: small, medium, large, xlarge, and xxlarge. It was a lot, but the design called for it!</p><p>I utilized server-side rendering, Google’s job schema for Google Jobs, and Open Graph tags on our job posting pages to ensure our postings could be found and shared by anyone looking for them on any platform.</p><p>The website went live in the fall of 2020. As a result of the website, prospective employees can submit contact forms directly to HR at Bankers Healthcare Group, and the job listings are displayed on our own domain, rather than linking to the third-party site we use for applications and talent acquisition.</p>"
    } 
]
